Documents/Зачет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Зачет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПокупателями</xr:Item>
				<xr:Item>AccumulationRegister.ФинансовыйРезультат</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПоставщиками</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Покупатель</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КредитныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сальдо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КредитныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сальдо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСПокупателями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСПокупателями</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Comment>Сумма в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КорСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Внутренний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КредитныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделыВМагазинах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Внутренний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделительУчёта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделителиУчёта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Зачет/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаВыбора(выбранноеЗначение, источникВыбора)
	
	типВыбранногоЗначения = ТипЗнч(выбранноеЗначение);
	
	Если типВыбранногоЗначения = Тип("Структура") Тогда
		
		обработкаВыбораДолгов = Неопределено;
		Если выбранноеЗначение.Свойство("ОбработкаВыбораДолгов", обработкаВыбораДолгов) И обработкаВыбораДолгов Тогда
			
			Элементы.Покупатель.ТекущиеДанные.Менеджер 			= выбранноеЗначение.Менеджер;
			Элементы.Покупатель.ТекущиеДанные.КредитныйДокумент = выбранноеЗначение.КредДокумент;
			Элементы.Покупатель.ТекущиеДанные.Сальдо 			= выбранноеЗначение.Долг;
			Элементы.Покупатель.ТекущиеДанные.Сумма 			= выбранноеЗначение.Долг;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВзаиморасчетыКредитныйДокументНачалоВыбора(элемент, данныеВыбора, стандартнаяОбработка)
	
	стандартнаяОбработка = Ложь;
	
	структураПараметров = Новый Структура("Подразделение, ОкончаниеПериода, Контрагент", Объект.Подразделение, ?(Объект.Проведен, Объект.Дата, КонецДня(Объект.Дата)), Элементы.Покупатель.ТекущиеДанные.Контрагент);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораДолгов", СтруктураПараметров, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеНебольшойФирмойСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		Параметры.ЗначенияЗаполнения
	);
	
КонецПроцедуры


&НаСервере
Функция ЗаполнитьОстаткиПоПокупателюСервер()
	
	запрос = Новый Запрос;
	
	#Область ТекстЗапроса
	
	запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыСПокупателямиОстатки.Контрагент,
	|	ВзаиморасчетыСПокупателямиОстатки.Менеджер,
	|	ВзаиморасчетыСПокупателямиОстатки.КредитныйДокумент,
	|	СУММА(ВзаиморасчетыСПокупателямиОстатки.СуммаОстаток) КАК Сальдо,
	|	СУММА(ВзаиморасчетыСПокупателямиОстатки.СуммаОстаток) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
	|			&КонецПериода,
	|			Подразделение = &Подразделение
	|				И ВЫБОР
	|					КОГДА &ЕстьОтборКонтрагент
	|						ТОГДА Контрагент = &ОтборКонтрагент
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьОтборМенеджер
	|						ТОГДА Менеджер = &ОтборМенеджер
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ВзаиморасчетыСПокупателямиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыСПокупателямиОстатки.КредитныйДокумент,
	|	ВзаиморасчетыСПокупателямиОстатки.Контрагент,
	|	ВзаиморасчетыСПокупателямиОстатки.Менеджер
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВзаиморасчетыСПокупателямиОстатки.Менеджер.Наименование,
	|	ВзаиморасчетыСПокупателямиОстатки.Контрагент.Наименование,
	|	ВзаиморасчетыСПокупателямиОстатки.КредитныйДокумент.Дата";
	
	#КонецОбласти
	
	запрос.УстановитьПараметр("КонецПериода", Новый Граница(Объект.Дата, ВидГраницы.Включая));
	запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	запрос.УстановитьПараметр("ОтборКонтрагент", ОтборКонтрагент);
	запрос.УстановитьПараметр("ОтборМенеджер", ОтборМенеджер);
	запрос.УстановитьПараметр("ЕстьОтборКонтрагент", ЕстьОтборКонтрагент);
	запрос.УстановитьПараметр("ЕстьОтборМенеджер", ЕстьОтборМенеджер);
	
	результатЗапроса = запрос.Выполнить();
	
	Если результатЗапроса.Пустой() Тогда
		Возврат (Ложь);
	КонецЕсли;
	
	выборка = результатЗапроса.Выбрать();
	Пока выборка.Следующий() Цикл
		
		новаяСтрока = Объект.Покупатель.Добавить();
		ЗаполнитьЗначенияСвойств(новаяСтрока, Выборка);
		
	КонецЦикла;
	
	Возврат (Истина);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьОстаткиПоПокупателю(команда)
	
	Если Объект.Проведен Тогда
		Предупреждение("Необходимо отменить проведение документа!");
		Возврат;
	КонецЕсли;
	
	параметрыОтбора = ПолучитьФорму("Документ.Зачет.Форма.ОтборПоКонтрагентуМенеджеру").ОткрытьМодально();
	
	Если параметрыОтбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборКонтрагент = параметрыОтбора.Контрагент;
	ОтборМенеджер = параметрыОтбора.Менеджер;
	ЕстьОтборКонтрагент = параметрыОтбора.ЕстьОтборКонтрагент;
	ЕстьОтборМенеджер = параметрыОтбора.ЕстьОтборМенеджер;
	
	Если Не ЗаполнитьОстаткиПоПокупателюСервер() Тогда
		Предупреждение("Отсутствуют данные для заполнения");
	КонецЕсли;
	
КонецПроцедуры
